SQL_NAME_COMPANY = """
SELECT *
FROM "Компания"
WHERE id = {id}
"""

SQL_FIND_KV = """
SELECT "ЛЭП"."Напряжение"
FROM "Компания"
LEFT JOIN "Сеть" ON ("Сеть"."Компания" = "Компания".id)
LEFT JOIN "ЛЭП" ON ("Сеть".id = "ЛЭП"."Сеть")
WHERE "Компания".id = {id}
"""

SQL_FIND_SETT = """
SELECT "Сеть"."Название", "Сеть".id
FROM "Компания"
LEFT JOIN "Сеть" ON ("Сеть"."Компания" = "Компания".id)
WHERE "Компания".id = {id}
"""

SQL_FIND_KAB_DL = """
SELECT "ЛЭП"."Название", "Провод"."Длина_по_цепям", "Провод"."Длина_участка_по_цепям"
FROM "Компания"
LEFT JOIN "Сеть" ON ("Сеть"."Компания" = "Компания".id)
LEFT JOIN "ЛЭП" ON ("Сеть".id = "ЛЭП"."Сеть")
LEFT JOIN "Провод" ON ("ЛЭП".id = "Провод"."ЛЭП")
WHERE "Компания".id = {id} and "Провод"."Длина_по_цепям" is not Null and "Провод"."Длина_участка_по_цепям" is not Null
"""

SQL_FIND_ALL_MOSH = """
SELECT "Трансформатор"."Номинальная_мощность"
FROM "Компания"
LEFT JOIN "Сеть" ON ("Сеть"."Компания" = "Компания".id)
LEFT JOIN "РЭС" ON ("Сеть".id = "РЭС"."Сеть")
LEFT JOIN "Подстанция" ON ("РЭС".id = "Подстанция"."РЭС")
LEFT JOIN "Трансформатор" ON ("Подстанция".id = "Трансформатор"."Подстанция")
WHERE "Компания".id = {id}
"""

SQL_FIND_SETT_MOSH = """
SELECT "Трансформатор"."Номинальная_мощность"
FROM "Сеть"
LEFT JOIN "РЭС" ON ("Сеть".id = "РЭС"."Сеть")
LEFT JOIN "Подстанция" ON ("РЭС".id = "Подстанция"."РЭС")
LEFT JOIN "Трансформатор" ON ("Подстанция".id = "Трансформатор"."Подстанция")
WHERE "Сеть".id = {id}
"""

SQL_FIND_ALL_PODST = """
SELECT *
FROM "Компания"
LEFT JOIN "Сеть" ON ("Сеть"."Компания" = "Компания".id)
LEFT JOIN "РЭС" ON ("Сеть".id = "РЭС"."Сеть")
LEFT JOIN "Подстанция" ON ("РЭС".id = "Подстанция"."РЭС")
WHERE "Компания".id = {id}
"""

SQL_FIND_SETT_PODST = """
SELECT *
FROM "Сеть"
LEFT JOIN "РЭС" ON ("Сеть".id = "РЭС"."Сеть")
LEFT JOIN "Подстанция" ON ("РЭС".id = "Подстанция"."РЭС")
WHERE "Сеть".id = {id}
"""

SQL_FIND_PODST_OLD = """
SELECT *
FROM "Сеть"
LEFT JOIN "РЭС" ON ("Сеть".id = "РЭС"."Сеть")
LEFT JOIN "Подстанция" ON ("РЭС".id = "Подстанция"."РЭС")
WHERE "Сеть".id = {id} AND "Подстанция"."Год_ввода" < {year}-50
"""

SQL_FIND_MOSH_OLD = """
SELECT *
FROM "Сеть"
LEFT JOIN "РЭС" ON ("Сеть".id = "РЭС"."Сеть")
LEFT JOIN "Подстанция" ON ("РЭС".id = "Подстанция"."РЭС")
LEFT JOIN "Трансформатор" ON ("Подстанция".id = "Трансформатор"."Подстанция")
WHERE "Сеть".id = {id} AND "Подстанция"."Год_ввода" < {year}-50
"""

SQL_FIND_KAB_SET_DL = """
SELECT "ЛЭП"."Название", "Провод"."Длина_по_цепям", "Провод"."Длина_участка_по_цепям"
FROM "Сеть"
LEFT JOIN "ЛЭП" ON ("Сеть".id = "ЛЭП"."Сеть")
LEFT JOIN "Провод" ON ("ЛЭП".id = "Провод"."ЛЭП")
WHERE "Сеть".id = {id} and "Провод"."Длина_по_цепям" is not Null and "Провод"."Длина_участка_по_цепям" is not Null
"""

SQL_FIND_KAB_SET_OLD = """
SELECT "ЛЭП"."Название", "Провод"."Длина_по_цепям", "Провод"."Длина_участка_по_цепям"
FROM "Сеть"
LEFT JOIN "ЛЭП" ON ("Сеть".id = "ЛЭП"."Сеть")
LEFT JOIN "Провод" ON ("ЛЭП".id = "Провод"."ЛЭП")
WHERE "Сеть".id = {id} and "Провод"."Длина_по_цепям" is not Null and "Провод"."Длина_участка_по_цепям" is not Null and "Провод"."Год_ввода" < {year}-50
"""