LEP = (
    "Сеть",
    "Номер_по_порядку",
    "Название",
    "Диспетчерское_наименование",
    "Напряжение",
    "Техническое_состояние"
)

PROVOD = (
    "ЛЭП",
    "Марка",
    "Год_ввода",
    "Количество_цепей",
    "Длина_по_трассе",
    "Длина_по_цепям",
    "Длина_участка_по_трассе",
    "Длина_участка_по_цепям",
)

RES = (
    "Сеть",
    "Название"
)

PODSTANC = (
    "Название",
    "Подстанционный_номер",
    "Год_ввода",
    "Класс_напряжения",
    "РЭС",
    "Сеть",
)

TRANSFORM = (
    "Подстанция",
    "Год_изготовления",
    "Год_включения",
    "Тип",
    "Номинальная_мощность",
    "Техническое_состояние",
    "Номер"
)